artworks/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "artworks".* FROM "artworks"
---
    def index
        if params.has_key?(:user_id)
            artwork = Artwork.where(artist_id: params[:user_id])
            render json: artwork
        else
            artworks = Artwork.all