artworks/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is so cool"], ["author_id", 1], ["artwork_id", 1], ["created_at", "2023-09-28 17:58:39.065242"], ["updated_at", "2023-09-28 17:58:39.065242"]]

    def destroy
        comment = Comment.find_by(id: params[:id])
        comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]

    def index
        if params.has_key?(:user_id)
            comment = Comment.where(author_id: params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]