artworks/app/controllers/likes_controller.rb

INSERT INTO "likes" ("liker_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liker_id", 1], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2023-09-28 20:32:19.076390"], ["updated_at", "2023-09-28 20:32:19.076390"]]
---
    def create
        like = Like.new(like_params)
        if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]
---
    def destroy
        like = Like.find_by(id: params[:id])
        like.destroy

SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes"
---
    def index
        if params.has_key?(:query)
            like = Like.find_by(id: params[:query])
            render json: like
        else
            likes = Like.all