artworks/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "yuri"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
      if params.has_key?(:query)
        user = User.find_by(username: params[:query])
        render json: user
      else
        users = User.all